app/views/devise/registrations/new.html.erb

SELECT "roles".* FROM "roles"
---
      <%= f.label :role_name %><br />
      <%= f.select :role_name, Role.all.map { |r| [r.name, r.name] }, { include_blank: 'Sélectionnez votre rôle' }, { class: "form-control mt-2" } %>