app/views/projects/index.html.erb

SELECT "roles"."name" FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 3]]
---
  <!--<h3 class="fs-50 text-center my-5"><%=current_user.has_role? :admin%></h3>
  <%=current_user.roles.pluck(:name)%>-->