app/controllers/attaches_controller.rb

  def index
    @attaches = Attach.all
---
SELECT "attaches".* FROM "attaches"

  def create
    @attach = Attach.new(attach_params)
    #@attach = current_user.attaches.build(attach_params)

    respond_to do |format|
      if @attach.save
---
INSERT INTO "attaches" ("file", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?) RETURNING "id"  [["file", nil], ["created_at", "2024-03-24 23:37:26.868058"], ["updated_at", "2024-03-24 23:37:26.868058"], ["user_id", nil]]

  def update
    respond_to do |format|
      if @attach.update(attach_params)
---
UPDATE "attaches" SET "updated_at" = ? WHERE "attaches"."id" = ?  [["updated_at", "2024-03-25 00:25:18.895843"], ["id", 3]]

  def destroy
    @attach.destroy!
---
DELETE FROM "attaches" WHERE "attaches"."id" = ?  [["id", 1]]

    def set_attach
      @attach = Attach.find(params[:id])
---
SELECT "attaches".* FROM "attaches" WHERE "attaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]