app/controllers/discussions_controller.rb

  def index
    @discussions = Discussion.all
---
SELECT "discussions".* FROM "discussions"

  def create
    @discussion = Discussion.new(discussion_params)

    if current_user
      @discussion.user = current_user
      @discussion.save
---
INSERT INTO "discussions" ("nom", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["nom", "kcliucuycutcutc"], ["user_id", 6], ["created_at", "2024-03-24 23:11:03.877659"], ["updated_at", "2024-03-24 23:11:03.877659"]]

  def update
    respond_to do |format|
      if @discussion.update(discussion_params)
---
UPDATE "discussions" SET "nom" = ?, "updated_at" = ? WHERE "discussions"."id" = ?  [["nom", "First"], ["updated_at", "2024-03-20 23:42:29.362695"], ["id", 1]]

  def destroy
    @discussion.destroy!
---
DELETE FROM "discussions" WHERE "discussions"."id" = ?  [["id", 4]]

    def set_discussion
      @discussion = Discussion.find(params[:id])
---
SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]