app/controllers/messages_controller.rb

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def index
    @discussion = Discussion.find(params[:discussion_id])

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def new
    @discussion = Discussion.find(params[:discussion_id])

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @discussion = Discussion.find(params[:discussion_id])

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "messages" ("contenu", "user_id", "discussion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["contenu", "Test Destroy"], ["user_id", 3], ["discussion_id", 3], ["created_at", "2024-03-24 01:43:09.730386"], ["updated_at", "2024-03-24 01:43:09.730386"]]
---
  def create
    @discussion = Discussion.find(params[:discussion_id])
    @message = @discussion.messages.build(message_params) # Utilisez 'messages.build' ici
    @message.user = current_user
    # ... le reste de l'action create ...
    #@message = Message.new(message_params)
    #@discussion = Discussion.find(params[:discussion_id])
    #@message = current_user.message.build(message_params)

    respond_to do |format|
      if @message.save

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "messages" SET "contenu" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["contenu", "000000000000000000000000000000000000000000000000000000000000000000000000"], ["updated_at", "2024-03-24 01:39:17.471400"], ["id", 1]]
---
  def update
    @discussion = Discussion.find(params[:discussion_id])
    @messages = @discussion.messages
    respond_to do |format|
      if @message.update(message_params)

SELECT "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."discussion_id" = ? AND "messages"."id" = ? LIMIT ?  [["discussion_id", 3], ["id", 3], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 3]]
---
  def destroy
    @discussion = Discussion.find(params[:discussion_id])
    @message = @discussion.messages.find(params[:id])
    @message.destroy

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_message
      @message = Message.find(params[:id])