app/controllers/projects_controller.rb

  def create
    #@project = Project.new(project_params)
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Kaka"], ["description", "oibnqogibq"], ["created_at", "2024-02-03 15:51:56.028270"], ["updated_at", "2024-02-03 15:51:56.028270"], ["user_id", 4]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "description of manioc"], ["updated_at", "2024-03-23 20:59:06.321838"], ["id", 2]]

  def destroy
    @project.destroy!
---
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 4]]

  def correct_user!
    @project = current_user.projects.find_by(id: params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 5], ["id", 2], ["LIMIT", 1]]

    def set_project
      @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]