app/controllers/truetasks_controller.rb

SELECT "truetasks".* FROM "truetasks"
---
  def index
    @truetasks = Truetask.all

INSERT INTO "truetasks" ("name", "description", "created_at", "updated_at", "done") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "New task"], ["description", "This is my new task"], ["created_at", "2024-03-22 18:37:23.896355"], ["updated_at", "2024-03-22 18:37:23.896355"], ["done", 1]]
---
  def create
    @truetask = Truetask.new(truetask_params)


    respond_to do |format|
      if @truetask.save

UPDATE "truetasks" SET "updated_at" = ?, "done" = ? WHERE "truetasks"."id" = ?  [["updated_at", "2024-03-22 19:03:45.087845"], ["done", 1], ["id", 2]]
---
  def update
    respond_to do |format|
      if @truetask.update(truetask_params)

DELETE FROM "truetasks" WHERE "truetasks"."id" = ?  [["id", 2]]
---
  def destroy
    @truetask.destroy!

SELECT "truetasks".* FROM "truetasks" WHERE "truetasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_truetask
      @truetask = Truetask.find(params[:id])